In [1]:
#importing libraries for analysis

import numpy as np #numpy for linear algebra
import pandas as pd #pandas for data manipulation and analysis
import seaborn as sb #seabirn for visualisation
import matplotlib as mp #for visualisation

In [2]:
#loading our csv data file
df = pd.read_csv('insurance.csv')

In [3]:
#listing the first 5 rows
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
#listing last 5 rows
df.tail()

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [5]:
#showing randow 10 sample rows
df.sample(10)

      age     sex     bmi  children smoker     region      charges
583    32  female  23.650         1     no  southeast  17626.23951
1195   19  female  27.930         3     no  northwest  18838.70366
109    63    male  35.090         0    yes  southeast  47055.53210
1114   23    male  24.510         0     no  northeast   2396.09590
900    49    male  22.515         0     no  northeast   8688.85885
390    48    male  35.625         4     no  northeast  10736.87075
833    58    male  34.390         0     no  northwest  11743.93410
1277   32  female  29.735         0     no  northwest   4357.04365
184    44    male  30.690         2     no  southeast   7731.42710
1144   50    male  32.300         2     no  southwest   9630.39700

In [6]:
#Information about the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [7]:
#shape of the dataframe -> rows and columns (observations and variables)
df.shape

(1338, 7)

The data has 1338 observations and 7 columns (variables)

In [8]:
#It gives the columns in the dataframe
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [9]:
#It provides descriptive statistics for us.
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [10]:
#The describe will return statistics for numeric datatypes.For strings and timestamps, we have to use 'include = 'O' '
df.describe(include='O')

         sex smoker     region
count   1338   1338       1338
unique     2      2          4
top     male     no  southeast
freq     676   1064        364

In [11]:
#It will give descriptive statistics for all datatypes
df.describe(include='all')

,age,sex,bmi,children,smoker,region,charges
count,1338.000000,1338,1338.000000,1338.000000,1338,1338,1338.000000
unique,NaN,2,NaN,NaN,2,4,NaN
top,NaN,male,NaN,NaN,no,southeast,NaN
freq,NaN,676,NaN,NaN,1064,364,NaN
mean,39.207025,NaN,30.663397,1.094918,NaN,NaN,13270.422265
std,14.049960,NaN,6.098187,1.205493,NaN,NaN,12110.011237
min,18.000000,NaN,15.960000,0.000000,NaN,NaN,1121.873900
25%,27.000000,NaN,26.296250,0.000000,NaN,NaN,4740.287150
50%,39.000000,NaN,30.400000,1.000000,NaN,NaN,9382.033000
75%,51.000000,NaN,34.693750,2.000000,NaN,NaN,16639.912515
max,64.000000,NaN,53.130000,5.000000,NaN,NaN,63770.428010

In [12]:
#The unique method gives the unique values for the Object datatype -> sex.
df.sex.unique()

array(['female', 'male'], dtype=object)

In [13]:
list(df.region.unique())

['southwest', 'southeast', 'northwest', 'northeast']

In [14]:
list(df.smoker.unique())

['yes', 'no']

In [15]:
df.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

Data cleaning:
    This step is very important because we have to analyse and visualise. For this, the data has to be clean.

In [16]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

There are no missing values. So, we don't have to worry about any missing values.

Checking for duplicates

In [17]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1333    False
1334    False
1335    False
1336    False
1337    False
Length: 1338, dtype: bool

The above code will give the each rows with a boolean values. If the rows are duplicates, they are mentioned as True (They are duplicates). If they aren't, it is False.

In [18]:
df.duplicated(keep = 'first')

0       False
1       False
2       False
3       False
4       False
        ...
1333    False
1334    False
1335    False
1336    False
1337    False
Length: 1338, dtype: bool

The ' keep = 'first' ' will tell the program to take the rows as duplicates except the first occurence.

In [19]:
df[df.duplicated(keep = 'first')]

     age   sex    bmi  children smoker     region    charges
581   19  male  30.59         0     no  northwest  1639.5631

The above will give the rows which are marled as True.

Then how can we remove duplicates?

In [24]:
df.drop_duplicates(keep = 'first', inplace = True)

The duplicates will be dropped from the dataframe. The attribute 'inplace = True' is important, so that it will remove the duplicates from the dataframe.

In [25]:
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1337 rows x 7 columns]

You can see that the df has one row less than the previous one. So, if you want to delete permanently from the dataframe, use 'inplace = True'